updated the functions and add new diagrams
